# 参考文献

https://www.liaoxuefeng.com/wiki/1177760294764384/1179610621264704

In [2]:
%load_ext sql
# No module named 'MySQLdb' 解决办法为 pip install mysqlclient
%sql mysql://root:xhy12315@localhost/test
# 当前连接到root用户的test数据库

# 目录

- [insert](#insert)
- [update](#update)
- [delete](#delete)

关系数据库的基本操作就是增删改查，即CRUD：Create、Retrieve、Update、Delete。其中，对于查询，我们已经详细讲述了SELECT语句的详细用法。

而对于增、删、改，对应的SQL语句分别是：

- INSERT：插入新记录；
- UPDATE：更新已有记录；
- DELETE：删除已有记录。

# insert

`INSERT INTO <表名> (字段1, 字段2, ...) VALUES (值1, 值2, ...);`

- `id`字段是一个自增主键，它的值可以由数据库自己推算出来。此外，如果一个字段有默认值，那么在`INSERT`语句中也可以不出现。
- 字段顺序不必和数据库表的字段顺序一致，但值的顺序必须和字段顺序一致。
- 可以一次性添加多条记录，只需要在`VALUES`子句中指定**多个记录值**，每个记录是由(...)包含的一组值

In [3]:
%sql insert into students (class_id,name,gender,score) values (2,'Tom','M',66)

 * mysql://root:***@localhost/test
1 rows affected.

[]

In [5]:
%%sql
INSERT INTO students (class_id, name, gender, score) VALUES
(1, 'dabao', 'M', 87),
(2, 'erbao', 'M', 81);

 * mysql://root:***@localhost/test
2 rows affected.

[]

In [6]:
%sql select * from students

 * mysql://root:***@localhost/test
14 rows affected.

[(1, 1, 'xiaoming', 'M', 90),
 (2, 1, 'xiaohong', 'F', 95),
 (3, 1, 'xiaojun', 'M', 88),
 (4, 1, 'xiaomi', 'F', 73),
 (5, 2, 'xiaobai', 'F', 81),
 (6, 2, 'xiaobing', 'M', 55),
 (7, 2, 'xiaolin', 'M', 85),
 (8, 3, 'xiaoxin', 'F', 91),
 (9, 3, 'xiaowang', 'M', 89),
 (10, 3, 'xiaoli', 'F', 85),
 (11, 5, 'new', 'M', 88),
 (12, 2, 'Tom', 'M', 66),
 (13, 1, 'dabao', 'M', 87),
 (14, 2, 'erbao', 'M', 81)]

# update

`UPDATE <表名> SET 字段1=值1/表达式1, 字段2=值2/表达式2, ... [WHERE ...];`

- 如果`WHERE`条件没有匹配到任何记录，`UPDATE`语句不会报错，也不会有任何记录被更新。
- 没有`where`会把整个表更新，所以要小心，最好先用`select`测试`where`是否筛选出目标记录再`update`

例如，我们想更新students表id=1的记录的name和score这两个字段，先写出UPDATE students SET name='大牛', score=66，然后在WHERE子句中写出需要更新的行的筛选条件id=1：

In [7]:
%sql update students set name='Tom',score=77 where id=1;

 * mysql://root:***@localhost/test
1 rows affected.

[]

In [8]:
%sql select * from students

 * mysql://root:***@localhost/test
14 rows affected.

[(1, 1, 'Tom', 'M', 77),
 (2, 1, 'xiaohong', 'F', 95),
 (3, 1, 'xiaojun', 'M', 88),
 (4, 1, 'xiaomi', 'F', 73),
 (5, 2, 'xiaobai', 'F', 81),
 (6, 2, 'xiaobing', 'M', 55),
 (7, 2, 'xiaolin', 'M', 85),
 (8, 3, 'xiaoxin', 'F', 91),
 (9, 3, 'xiaowang', 'M', 89),
 (10, 3, 'xiaoli', 'F', 85),
 (11, 5, 'new', 'M', 88),
 (12, 2, 'Tom', 'M', 66),
 (13, 1, 'dabao', 'M', 87),
 (14, 2, 'erbao', 'M', 81)]

In [9]:
%sql update students set name='Tom',score=77 where id>3 and id<6;

 * mysql://root:***@localhost/test
2 rows affected.

[]

一次修改多条记录：

In [10]:
%sql select * from students

 * mysql://root:***@localhost/test
14 rows affected.

[(1, 1, 'Tom', 'M', 77),
 (2, 1, 'xiaohong', 'F', 95),
 (3, 1, 'xiaojun', 'M', 88),
 (4, 1, 'Tom', 'F', 77),
 (5, 2, 'Tom', 'F', 77),
 (6, 2, 'xiaobing', 'M', 55),
 (7, 2, 'xiaolin', 'M', 85),
 (8, 3, 'xiaoxin', 'F', 91),
 (9, 3, 'xiaowang', 'M', 89),
 (10, 3, 'xiaoli', 'F', 85),
 (11, 5, 'new', 'M', 88),
 (12, 2, 'Tom', 'M', 66),
 (13, 1, 'dabao', 'M', 87),
 (14, 2, 'erbao', 'M', 81)]

In [11]:
%sql update students set score=score+10 where score>90;

 * mysql://root:***@localhost/test
2 rows affected.

[]

In [13]:
%sql select * from students

 * mysql://root:***@localhost/test
14 rows affected.

[(1, 1, 'dada', 'M', 77),
 (2, 1, 'xiaohong', 'F', 105),
 (3, 1, 'xiaojun', 'M', 88),
 (4, 1, 'Tom', 'F', 77),
 (5, 2, 'Tom', 'F', 77),
 (6, 2, 'xiaobing', 'M', 55),
 (7, 2, 'xiaolin', 'M', 85),
 (8, 3, 'xiaoxin', 'F', 101),
 (9, 3, 'xiaowang', 'M', 89),
 (10, 3, 'xiaoli', 'F', 85),
 (11, 5, 'new', 'M', 88),
 (12, 2, 'Tom', 'M', 66),
 (13, 1, 'dabao', 'M', 87),
 (14, 2, 'erbao', 'M', 81)]

# delete

`DELETE FROM <表名> [WHERE ...];`

- `where`可以删除多行
- 不带`WHERE`条件的`DELETE`语句会删除整个表的数据.所以，在执行DELETE语句时也要非常小心，最好先用SELECT语句来测试WHERE条件是否筛选出了期望的记录集，然后再用DELETE删除
- 如果`WHERE`条件没有匹配到任何记录，`DELETE`语句不会报错，也不会有任何记录被删除。
- 在使用MySQL这类真正的关系数据库时，`DELETE`语句也会返回删除的行数以及`WHERE`条件匹配的行数。

例如，我们想删除students表中id=1的记录，就需要这么写：

In [14]:
%sql DELETE FROM students WHERE id=1;

 * mysql://root:***@localhost/test
1 rows affected.

[]

In [15]:
%sql select * from students

 * mysql://root:***@localhost/test
13 rows affected.

[(2, 1, 'xiaohong', 'F', 105),
 (3, 1, 'xiaojun', 'M', 88),
 (4, 1, 'Tom', 'F', 77),
 (5, 2, 'Tom', 'F', 77),
 (6, 2, 'xiaobing', 'M', 55),
 (7, 2, 'xiaolin', 'M', 85),
 (8, 3, 'xiaoxin', 'F', 101),
 (9, 3, 'xiaowang', 'M', 89),
 (10, 3, 'xiaoli', 'F', 85),
 (11, 5, 'new', 'M', 88),
 (12, 2, 'Tom', 'M', 66),
 (13, 1, 'dabao', 'M', 87),
 (14, 2, 'erbao', 'M', 81)]

In [16]:
%sql delete from students where id <4;

 * mysql://root:***@localhost/test
2 rows affected.

[]

In [17]:
%sql select * from students

 * mysql://root:***@localhost/test
11 rows affected.

[(4, 1, 'Tom', 'F', 77),
 (5, 2, 'Tom', 'F', 77),
 (6, 2, 'xiaobing', 'M', 55),
 (7, 2, 'xiaolin', 'M', 85),
 (8, 3, 'xiaoxin', 'F', 101),
 (9, 3, 'xiaowang', 'M', 89),
 (10, 3, 'xiaoli', 'F', 85),
 (11, 5, 'new', 'M', 88),
 (12, 2, 'Tom', 'M', 66),
 (13, 1, 'dabao', 'M', 87),
 (14, 2, 'erbao', 'M', 81)]